"""
С помощью декораторов реализовать конвейер сборки бургера

Написать декоратор bread, который:
 - до декорируемой функции будет печатать "</------------\\>"
 - после декорируемой функции будет печатать "<\\____________/>"


Написать декоратор tomato, который:
 - до декорируемой функции будет печатать "*** помидоры ****"

Написать декоратор salad, который:
 - до декорируемой функции будет печатать "~~~~ салат ~~~~~"

Написать декоратор cheese, который:
 - до декорируемой функции будет печатать "^^^^^ сыр ^^^^^^"

Написать декоратор onion, который:
 - до декорируемой функции будет печатать "----- лук ------"

Написать функцию beef, которая:
 - печатает "### говядина ###"

Написать функцию chicken, которая:
 - печатает "|||| курица ||||"

1) Собрать с помощью декораторов гамбургер:
    - булка
    - лук
    - помидоры
    - говядина
    - булка

2) Собрать с помощью декораторов чикенбургер:
    - булка
    - сыр
    - салат
    - курица
    - булка
"""



def bread(func):
    def wr():
        print("</------------\\>")
        func()
        print("<\\____________/>")
    return wr

def tomato(func):
    def wr():
        print("*** помидоры ****")
        func()
    return wr

def salad(func):
    def wr():
        print("~~~~ салат ~~~~~")
        func()
    return wr

def cheese(func):
    def wr():
        print("^^^^^ сыр ^^^^^^")
        func()
    return wr

def onion(func):
    def wr():
        print("----- лук ------")
        func()
    return wr



@bread
@onion
@tomato

def beef():
    return print("### говядина ###")

@bread
@cheese
@salad
def chicken():
    return print("|||| курица ||||")



beef()

print("\n------------------------\n \n")
chicken()