"""
Написать рекурсивную функцию sum_of_numbers, которая будет вычислять сумму
цифр целого числа.

Можно пользоваться только функциями, операторами и условиями.
"""

def sum_n(x):
    a = list(x)
    def sum_n2(a):
        return sum(map(int,a))
    return sum_n2(a)


b = "123456"

print(sum_n(b))


