"""
Написать рекурсивную функцию sum_of_numbers, которая будет вычислять сумму
цифр целого числа.

Можно пользоваться только функциями, операторами и условиями.
"""
def sum_of_numbers(s):
    return sum(map(int, s))


a = input("Чувачек, введи циферки")
print(sum_of_numbers(a))