"""
Написать рекурсивную функцию sum_of_numbers, которая будет вычислять сумму
цифр целого числа.

Можно пользоваться только функциями, операторами и условиями.
"""

def sum_n(n, s=0):
    if s==len(n): return 0
    return sum_n(n,s+1) + int(n[s])

n = 123456


print(sum_n(str(n)))

