"""
Напишите функцию yes_or_no, которая принимает список из целых чисел,
проходит по нему и выводит Yes, если число уже встречалось и No, если нет
"""

def yes_no (x):
    x1 = set(x)
    if len(x) == len(x1):
        print("No")
    else:
        print("Yes")

a = [1,2,3,4,5]
b = [1,2,3,4,2]

yes_no(a)
yes_no(b)